; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	Star13 - direction
	GroundStation14 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	GroundStation12 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation10)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation14)
)
(:goal (and
	(pointing satellite0 Planet16)
	(have_image Phenomenon15 infrared1)
	(have_image Planet16 thermograph0)
	(have_image Phenomenon17 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation10 groundstation14)
   deleted: (pointing satellite1 groundstation14)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 4
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 0 of 4
4. (turn_to satellite1 phenomenon15 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 4
5. (turn_to satellite0 planet16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet16)
   goals met: 1 of 4
6. (take_image satellite1 phenomenon15 instrument1 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 2 of 4
7. (turn_to satellite1 phenomenon17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 4
8. (take_image satellite1 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 3 of 4
9. (turn_to satellite1 planet16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet16)
   goals met: 3 of 4
10. (take_image satellite1 planet16 instrument1 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 4 of 4
